<?php
//------------------------------------------------------------------
// 1. Написати програму на PHP, яка містить користувацьку функцію
// для обчислення площі кола та демонструє використання передачі даних
// у функцію за допомогою параметрів.
//-----------------------------------------------------------------

// Користувацька функція для обчислення площі кола
function calculateCircleArea($radiusValue) {
    // Формула для обчислення площі кола: π * r^2
    $area = M_PI * $radiusValue * $radiusValue;
    return $area;
}

// Радіус кола
$radius = 5.0;

// Викликаємо функцію та передаємо радіус у якості параметру
$circleArea = calculateCircleArea($radius);

// Виводимо результат
echo "Площа кола з радіусом $radius одиниць: $circleArea квадратних одиниць.";